'use strict';

/* 	
	ბმა — სიტყვა
	ბამ — ფუძე
	ბ   — ძირი
*/

const ხმოვნები = ['ა', 'ე', 'ი', 'ო', 'უ'];

const ბოლოსართები = {
	ო    : {
		ემფატიკური : false,
		ბოლოკიდურა : true
	},
	ა    : {ემფატიკური : false},
	ელ   : {ემფატიკური : false},
	ურ   : {ემფატიკური : false},
	ულ   : {ემფატიკური : false},
	მდე  : {ემფატიკური : false},
	კენ  : {ემფატიკური : true},
	დან  : {ემფატიკური : true},
	გან  : {ემფატიკური : true},
	თვის : {ემფატიკური : true},
	მ    : {ემფატიკური : true},
	ის   : {ემფატიკური : true},
	ს    : {ემფატიკური : true},
	ით   : {ემფატიკური : true},
	თ    : {ემფატიკური : true},
	ად   : {ემფატიკური : true},
	დ    : {ემფატიკური : true},
	ით   : {ემფატიკური : true},
	ება  : {ემფატიკური : false},
	ობა  : {ემფატიკური : false},
	ვა   : {ემფატიკური : false},
};

const აღწერა = {
	არსებითი : function (აღწ) {
		// ბოლოხმოვნიანი, კვეცადი, კუმშვადი, წესიერი
		return {
			ბოლოხმოვნიანი : აღწ.charAt(0) === '0' ? false : true,
			კვეცადი       : აღწ.charAt(1) === '0' ? false : true,
			კუმშვადი      : აღწ.charAt(2) === '0' ? false : true,
			წესიერი       : აღწ.charAt(3) === '0' ? false : true
		}
	}
};

const სიტყვები = {
	სახლი : {
		კლასი  : 'არსებითი',
		აღწერა : '0001'
	},
	კედელი : {
		კლასი  : 'არსებითი',
		აღწერა : '0011'
	},
	მანქანა : {
		კლასი  : 'არსებითი',
		აღწერა : '1101'
	},
	ქვეყანა : {
		კლასი  : 'არსებითი',
		აღწერა : '1111'
	},
	თავი : {
		კლასი  : 'არსებითი',
		აღწერა : '0001'
	},
	ამბავი : {
		კლასი  : 'არსებითი',
		აღწერა : '0010',
		ფუძე   : 'ამბ'
	}
};

const ყველა_ბოლოსართი = (function () {
	var out = [];
	for (var ბოლოსართი in ბოლოსართები) {
		out.push(ბოლოსართი);
		if (ბოლოსართები.ემფატიკური) {
			out.push(ბოლოსართი - 'ა');
		}
	}
	return out;
})();

// დასახლება, სახლისაკენ, სახლში, კედლისაგან

function გაშალე_აღწერა (კლასი, აღწ) {
	if (აღწერა.hasOwnProperty(კლასი)) {
		return აღწერა[კლასი](აღწ);
	} else {
		console.log('გრამატიკული კლასი „' + კლასი + '“ არ ვიცი');
		return false:
	}
}

function იპოვე_ფუძე (სიტყვა) {
	if (სიტყვები.hasOwnProperty(სიტყვა)) {
		return გამოთვალე_ფუძე(სიტყვები[სიტყვა]);
	}
	var ბოლო = სიტყვა.substr(-1);
	if (ბოლო === 'ო') {
		
	}
}

function გამოთვალე_ფუძე (სიტყვა) {
	var აღწერა = გაშალე_აღწერა(სიტყვა.კლასი, სიტყვა.აღწერა);
	var ფუძე = აღწერა.ბოლოხმოვნიანი 
		? სიტყვა 
		: სიტყვა.კვეცადი 
			? სიტყვა.slice(0, -1)
			: სიტყვა;
	if (აღწერა.კუმშვადი) {
		ფუძე = შეკუმშე(ფუძე);
	}
	
}

function შეკუმშე (ფუძე) {
	for (var i = ფუძე.length - 1; i > -1; i--) {
		if (ხმოვნები.indexOf(ფუძე.charAt(i)) > -1) {
			return ფუძე.substring(0, i - 1) + (ფუძე.charAt(i) === 'ო' ? 'ვ' : '') + ფუძე.substr(i + 1)
		}
	}
	return ფუძე;
}